#!/usr/bin/env python
# -*- coding: utf-8 -*-

# @author: hongyue.pei
# @file: bc_v1.py
# @time: 2020/9/7 下午4:07
# @desc:


contents = ['共和国对外贸易60年—庆祝新中国成立60周年百种重点图书 裴长洪  主编，王万山  副主编 。60年的发展不仅表现为贸易规模的扩大，而且增长方式的转变也是明显的。新中国成立后的前30年，中国对外贸易突破了帝国主义的封锁，从无到有，从数量极其有限发展到200多亿美元的规模，换取了宝贵的外汇资源，支持了国家工业化建设。在出口贸易中，从20世纪70年代开始，出口商品结构出现了从农产品为主向工业制成品为主的转化趋势，进口商品结构也体现了工业化发展的需要。改革开放30年，我国出口商品结构经过了三次重要变化，出口商品的复杂程度愈来愈高，结构愈来愈趋同于经济比较发达的国家。进口商品结构则进一步反映了我国工业化进程的深入发展，国内加工制造能力和产业体系的配套完善以及人民生活水平的提高，进出口商品贸易的增长方式愈来愈符合全面建设小康社会的需要。    我国用60年走完了世界贸易大国的路程。到2008年，我国进出口贸易总额仅次于美国、出口贸易总额仅次于德国。但是，中国还不是贸易强国，这表现在两方面，一方面是，虽然中国对外贸易*量不小，但相对规模还很小，这表现在人口与世界市场份额很不相称。中国人口占世界的20.13％，2008年中国出口只占世界总出口的8.9％，而德国人口只占世界的1.26％，出口占9.1％；美国人口只占世界的4.6％，出口占8.1％；日本人口只占世界的1.96％，出口占世界的4.9％；欧元区15国人口只占世界的5.3％，出口却占到世界的34.8％。另一方面是，中国出口商品反映的产业结构还不全面和不够高级化，中国出口的商品是同类产品中的低端加工的产品，而且，加工贸易出口商品在国内创造的附加价值往往不超过商品价值的25％。中国成为贸易强国的道路还很漫长，中国还需要20年到30年才能实现贸易强国的梦想。在未来的20年到30年时间里，中国还需要继续增长和变革，还需要继续扩大开放与国际经济合作，还需要继续参与经济全球化并与贸易伙伴实现互利共赢。',
       '享誉京城的老店铺中国时代经济出版社王永斌  著。《享誉京城的老店铺》共介绍老店铺103家，行业齐全，既有经营传统中药的店铺，也有出赁喜轿、丧葬用具的店铺；既有经营餐馆食品的店铺，也有销售服装百货、绸布鞋帽的店铺；既有专卖钟表眼镜的公司，也有为顾客拍照的照相馆和理发馆、浴池。这些老店铺除万全堂、同仁堂等极少数存有店史档案资料供参考外，余者都是店铺的后人和店中老伙计口述而来。...',
       '二十世纪的英国经济——“英国病”研究,罗志如,厉以宁,商务印书馆。《二十世纪的英国经济--英国病研究》一书由罗志如、厉以宁编著，除“导论”和“英国经济的展望——代结束语”外，共十二章，分为上下两编。上编：“问题何在?——‘英国病’的诊断”，从四个方面说明了“英国病”的由来，即“世界工厂”地位的丧失及其留下的遗产，殖民扩张给国内经济带来的严重后果，福利国家、财政负担和低效率的经济，以及传统精神对经济稳定和增长的消极作用。下编：“回春无术——‘英国病’对策的剖析”，包括“国有化”的试验，需求管理的演变，“计划化”，收入政策及其在新形势下的运用，调整工会、企业界、政府三者之间的关系，以及继续调整对外经济关系等等。事实证明这些都未能奏效，英国经济将继续在“病态”中迟缓地走向未来。',
       '东亚近代经济的历史结构。21世纪初的现今，全世界存在经济圈，分别是以EU（欧盟）为核心的欧洲，以美国为中心的NAFTA（美国·加拿大·墨西哥）和东亚。其中，东亚是崛起而且发展为显著的地位。截至目前的经济史理论，近代之前以西欧为研究对象，现代主要以美国为研究对象。但是，现在东亚（东北亚·东南亚）形成了具有重要地位的经济圈。所以考察东亚近代资本主义的形成过程和各项条件，成为经济史研究的重要课题。而且，东亚近代资本主义的形成过程在很多方面与欧洲和美国不同，所以还需要结合东亚的历史情况，重新构筑经济史理论本身。本书就是基于这样的考虑。...',
       '日出日落：解密中日百年较量背后的资本逻辑,郝一生,东方出版社。百年沧桑，中国和日本作为东亚的两大后起国家，120年来经历了2次此消彼长的日出日落。120年前中国在甲午战争中的惨败，把日本推上了军国主义和对外扩张的不归路，当时的日本如旭日东升，中国则一步步夕阳日下。120年后的今天，中国连续30年的经济高速增长， 从2002年起GDP总量超越日本，位居世界第二；而日本经济却步履阑珊、踏步不前。那么，120年中这两个国家的经济发展和国力消长，怎么会出现如此巨大的天地翻覆呢？作者从资本投资角度，深入探究百年来中日两国经济发展此起彼落之谜，认为中国甲午战败的根本原因，是战前中国与日本在工业化投资规模上6.6倍的巨大落差；而支撑中国30年来经济持续高速增长的是高投资、高积累下的“重投资主义”。这对中国现今经济发展具有深刻的参考意义。',
       '转型期的北魏财政研究。历时400年左右的魏晋南北朝，是中国古代史蕴涵极为丰富的一段重要时期。其间社会的统一与分裂，政权的并存与更迭，民族的冲突与融合，经济的衰退与复兴，社会阶层的分化与升降，国家制度的沿革与转型，思想学术的激扬与嬗变，文化艺术的传承与创新，风云人物的神骨与际会。同时，魏晋南北朝史又以头绪纷繁、资料阙略不全而素称难治，常令人有治丝益棼、谈何容易之慨，也留有可深入探赜索隐的诸多学术空间，财政史即其一。本书即是对其财政研究的专著。《光明学术文库》是“十一五”国家重点图书出版规范项目。该出版工程采取“媒体发动，学界审评，光明出版，社会馆藏”的形式，常年征集、精选哲学社会科学领域的原创学术成果，及时向社会传播我国哲学社会科学研究前沿的新思想、新发现、新进展，推动我国哲学社会科学繁荣和发展。《光明学术文库》将秉承光明日报“理论前沿型、学术探索型、知识密集型”的传统风格，精心组织、精心编校、精心出版，充分发挥《光明日报》等主流媒体的宣传优势，宣传推广这项国家重点图书出版工程，力争使之成为中国哲学社会科学领域具有性的学术著作品牌。...',
       '中国古代的纳税与应役,陈明光,商务印书馆。《中国古代生活丛书：中国古代的纳税与应役》运用丰富的史料，在简明地梳理了中国古代赋役制度的来龙去脉之后，着重从社会生活史的层面，论述了中国古代不同社会阶层纳税应役的丁口依据、身份依据、职业依据、资产依据等，揭示了作为中国古代最主要税种的田赋的征纳诸场景，以及平民应承兵役、徭役、匠役的历史变化，分析了古代吏治状况对百姓纳税应役的影响，古代王朝的轻徭薄赋与苛税重役对社会治乱的影响等。',
       '在历史与经济之间梁小民  著中国社会科学出版社。历史学家治史和经济学家治史应该还是有差别的。历史学家要把历史事实搞清楚，还要在此基础上得出一些结论或总结出一些规律。而经济学家则是在历史学家研究的基础上，从经济学的角度来加以解释。这些解释可以是总结经济发展的顾虑，也可以是用来证明经济学理论的。听梁小民先生从历史的角度分析经济，你会收获从读史中了解了经济，从对经济的认识中体味历史的意外惊喜。...',
       '大曝光 [美] 戴维·麦克林蒂克,刘颖,谬岸熙 中信出版社，中信出版集团 。',
       '中国之棉纺织业,方显廷,商务印书馆。《中国之棉纺织业》是方显廷的代表作，是一部对中国棉纺织业进行全面调查与研究的重要著作。全书包括八章：中国棉纺织业之历史及其区域之分布、中国棉花之生产及贸易、中国棉纺织品之制造与销售、中国棉纺织业之劳工、中国棉纺织业之组织、中国之手工棉织业、中国棉纺织品之进出口贸易、中国棉纺织业之回顾与前瞻。全面论述了中国棉纺业历史与现状。书后附有大量统计表格，对了解中国棉纺织业历史及其发展有着重要参考价值。']

firstClass = ['经济', '经济', '经济', '经济', '经济', '经济', '经济', '经济', '经济', '经济']

from sklearn.feature_extraction.text import CountVectorizer
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.feature_extraction.text import TfidfTransformer

import jieba
contents = [' '.join(list(jieba.cut(x))) for x in contents]

countVectorizer = CountVectorizer()
x = countVectorizer.fit_transform(contents)
word = countVectorizer.get_feature_names()
print(word)
print(x.toarray())





